export const placeholder = {
  name: 'Введите имя и фамилию через пробел',
  email: 'Введите e-mail',
  tel: '+7 (___) ___-__-__',
  birthdate: 'Выберите дату рождения',
  message: 'Введите сообщение',
};

export const inputTitle = {
  name: 'Имя Фамилия',
  email: 'E-mail:',
  tel: 'Телефона:',
  birthdate: 'Дата рождения:',
  message: 'Сообщение:',
};

export const formTitle = 'Форма обратной связи';

export const formBTN = 'Отправить';

export const formErrors = {
  alphabet: 'Вы должны ввести имя и фамилию латинскими буквами.',
  nameSurnameLength: 'Ваши имя и фамилия должны быть не менее 3 символов и не более 30 символов.',
  nameLength: 'Ваше имя должно быть не менее 3 символов и не более 30 символов.',
  surnameLength: 'Ваша фамилия должна быть не менее 3 символов и не более 30 символов.',
  notTwoWords: 'Вы должны ввести имя и фамилию через пробел.',
  messageLength: 'Ваше сообщение должны быть не менее 10 символов и не более 300 символов.',
  tel: 'Некорректный номер телефона.',
  email: 'Некорректный e-mail.',
  date: 'Вы должны выбрать дату.',
  notFilled: 'Вы должны заполнить поле.',
};
